{
    "products": [
      {
        "id": 9,
        "category": "electronics",
        "title": "WD 2TB Elements Portable External Hard Drive - USB 3.0",
        "description": "USB 3.0 and USB 2.0 Compatibility Fast data transfers Improve PC Performance High Capacity; Compatibility Formatted NTFS for Windows 10, Windows 8.1, Windows 7; Reformatting may be required for other operating systems; Compatibility may vary depending on user’s hardware configuration and operating system",
        "image": "https://fakestoreapi.com/img/61IBBVJvSDL._AC_SY879_.jpg",
        "price": 64,
        "rating": {
          "rate": 3.3,
          "count": 203
        },
        "discount": 100,
        "colors": ["Black"],
        "stock": [
          {
            "color": "Black",
            "quantity": 25
          }
        ],
        "reviews": [
          {
            "username": "techlover",
            "comment": "Great storage capacity and speed for the price.",
            "rating": 4
          }
        ]
      },
      {
        "id": 10,
        "category": "electronics",
        "title": "SanDisk SSD PLUS 1TB Internal SSD - SATA III 6 Gb/s",
        "description": "Easy upgrade for faster boot up, shutdown, application load and response (As compared to 5400 RPM SATA 2.5” hard drive; Based on published specifications and internal benchmarking tests using PCMark vantage scores) Boosts burst write performance, making it ideal for typical PC workloads The perfect balance of performance and reliability Read/write speeds of up to 535MB/s/450MB/s (Based on internal testing; Performance may vary depending upon drive capacity, host device, OS and application.)",
        "image": "https://fakestoreapi.com/img/61U7T1koQqL._AC_SX679_.jpg",
        "price": 109,
        "rating": {
          "rate": 2.9,
          "count": 470
        },
        "discount": 90,
        "colors": ["Gray"],
        "stock": [
          {
            "color": "Gray",
            "quantity": 30
          }
        ],
        "reviews": [
          {
            "username": "SSDfan",
            "comment": "Super fast SSD. Improved my system speed immensely.",
            "rating": 5
          }
        ]
      },
      {
        "id": 11,
        "category": "electronics",
        "title": "Silicon Power 256GB SSD 3D NAND A55 SLC Cache Performance Boost SATA III 2.5",
        "description": "3D NAND flash are applied to deliver high transfer speeds Remarkable transfer speeds that enable faster bootup and improved overall system performance. The advanced SLC Cache Technology allows performance boost and longer lifespan 7mm slim design suitable for Ultrabooks and Ultra-slim notebooks. Supports TRIM command, Garbage Collection technology, RAID, and ECC (Error Checking & Correction) to provide the optimized performance and enhanced reliability.",
        "image": "https://fakestoreapi.com/img/71kWymZ+c+L._AC_SX679_.jpg",
        "price": 109,
        "rating": {
          "rate": 4.8,
          "count": 319
        },
        "discount": 95,
        "colors": ["Black", "Silver"],
        "stock": [
          {
            "color": "Black",
            "quantity": 10
          },
          {
            "color": "Silver",
            "quantity": 10
          }
        ],
        "reviews": [
          {
            "username": "slimnotebook",
            "comment": "Perfect SSD for my ultrabook. Lightweight and fast.",
            "rating": 5
          }
        ]
      }
      // Continue with other products similarly...
    ]
  }
  